# TitleStyleItalic Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TitleStyleItalic Property
ParameterTypeId Class See Also
---
"Italic"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TitleStyleItalic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TitleStyleItalic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TitleStyleItalic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace